<template>
  <div class="discription">
    <div class="discription__buttons">
      <vue-tabz
        :data="['one', 'two', 'three']"
        max-width="700"
        main-color="#F5BD02"
        @clickedTab="tabsHandler"
      />
    </div>

    <div class="discription__wrapp-accordion">
      <vue-collapsible-panel-group>
        <vue-collapsible-panel>
          <template #title>
            Как оформить заказ?
          </template>
          <template #content>
            Panel A Content
          </template>
        </vue-collapsible-panel>
        <vue-collapsible-panel>
          <template #title>
            Как подобрать игру?
          </template>
          <template #content>
            <p>Если в настольной игре собирается принять участие компания, нужно учитывать средний возраст игроков. Есть игры, которые не требуют активности и вряд ли понравятся молодёжи, а подвижные не придутся по душе пожилым людям.</p>
            <p>Многие игры предназначены только для большого количества участников, а другие — строго для двоих. Бывают и индивидуальные варианты, но чаще всего количество участников — от двух до четырёх.Количество игроков, на которое рассчитана игра, написано на её упаковке.
               Важно сразу решить, сколько человек примут участие в игре. Некоторые настольные игры могут быть скучны только для двоих. Если чаще будут играть именно двое, не стоит покупать игры, которые рассчитаны на большую компанию.</p>
            <p>Важно и то, как участники будут взаимодействовать между собой во время игры. Есть два основных варианта: каждый сам за себя или в команде.Реквизитом могут быть карты, игральные кости, бумага и карандаши, а также специальные приспособления, которые лежат в коробке.</p>
            <p>Выделяют несколько типов настольных игр: интеллектуальные, творческие, подвижные и кооперативные.Интеллектуальные больше предназначены для детей, которым надо развивать логику и эрудицию. В формате развлечений они смогут тренировать память и мышление. К таким играм относятся мемо, где надо запоминать картинки или слова.Стратегические и экономические развивают навыки предпринимателя и стратега. Они учат грамотному планированию.Творческие игры развивают воображение. Они требуют большей концентрации.
               Подвижные игры больше понравятся компаниям, потому что направлены на взаимодействие между игроками. 
               В кооперативной игре ребёнок будет развивать речь и коммуникативные навыки с помощью общения с другими игроками.</p>
            <p>Игры выбирают и по длительности процесса: от нескольких минут до нескольких часов.Время игры также зависит от количества участников и от того, насколько они хорошо знают правила. </p>
          </template>
        </vue-collapsible-panel> 
      </vue-collapsible-panel-group>
    </div>
  </div>
</template>

<script>

export default {
  
}

</script>

<style lang="scss" scoped>
  .discription {
    max-width: 727px;
  }
  p {
    margin-bottom: 10px;
  }

</style>