<template>
  <div class="accordion">
    <vue-collapsible-panel-group>
      <div class="accordion__item">
        <vue-collapsible-panel :expanded="false">
          <template #title>
            <h4>Как оформить заказ?</h4>
          </template>
          <template #content>
            <p>Зачем тебе это надо</p>
          </template>
        </vue-collapsible-panel>
      </div>

      <div class="accordion__item">
        <vue-collapsible-panel :expanded="false">
          <template #title>
            <h4>Как подобрать игру?</h4>
          </template>
          <template #content>
            <p>Если в настольной игре собирается принять участие компания, нужно учитывать средний возраст игроков. Есть игры, которые не требуют активности и вряд ли понравятся молодёжи, а подвижные не придутся по душе пожилым людям.</p>
            <p>Многие игры предназначены только для большого количества участников, а другие — строго для двоих. Бывают и индивидуальные варианты, но чаще всего количество участников — от двух до четырёх.Количество игроков, на которое рассчитана игра, написано на её упаковке.
                Важно сразу решить, сколько человек примут участие в игре. Некоторые настольные игры могут быть скучны только для двоих. Если чаще будут играть именно двое, не стоит покупать игры, которые рассчитаны на большую компанию.</p>
            <p>Важно и то, как участники будут взаимодействовать между собой во время игры. Есть два основных варианта: каждый сам за себя или в команде.Реквизитом могут быть карты, игральные кости, бумага и карандаши, а также специальные приспособления, которые лежат в коробке.</p>
            <p>Выделяют несколько типов настольных игр: интеллектуальные, творческие, подвижные и кооперативные.Интеллектуальные больше предназначены для детей, которым надо развивать логику и эрудицию. В формате развлечений они смогут тренировать память и мышление. К таким играм относятся мемо, где надо запоминать картинки или слова.Стратегические и экономические развивают навыки предпринимателя и стратега. Они учат грамотному планированию.Творческие игры развивают воображение. Они требуют большей концентрации.
                Подвижные игры больше понравятся компаниям, потому что направлены на взаимодействие между игроками. 
                В кооперативной игре ребёнок будет развивать речь и коммуникативные навыки с помощью общения с другими игроками.</p>
            <p>Игры выбирают и по длительности процесса: от нескольких минут до нескольких часов.Время игры также зависит от количества участников и от того, насколько они хорошо знают правила. </p>
          </template>
        </vue-collapsible-panel> 
      </div>
      <div class="accordion__item">
        <vue-collapsible-panel :expanded="false">
          <template #title>
            <h4>Как оплатить заказ?</h4>
          </template>
          <template #content>
            <p>Если в настольной игре собирается принять участие компания, нужно учитывать средний возраст игроков. Есть игры, которые не требуют активности и вряд ли понравятся молодёжи, а подвижные не придутся по душе пожилым людям.</p>
            <p>Многие игры предназначены только для большого количества участников, а другие — строго для двоих. Бывают и индивидуальные варианты, но чаще всего количество участников — от двух до четырёх.Количество игроков, на которое рассчитана игра, написано на её упаковке.
                Важно сразу решить, сколько человек примут участие в игре. Некоторые настольные игры могут быть скучны только для двоих. Если чаще будут играть именно двое, не стоит покупать игры, которые рассчитаны на большую компанию.</p>
            <p>Важно и то, как участники будут взаимодействовать между собой во время игры. Есть два основных варианта: каждый сам за себя или в команде.Реквизитом могут быть карты, игральные кости, бумага и карандаши, а также специальные приспособления, которые лежат в коробке.</p>
            <p>Выделяют несколько типов настольных игр: интеллектуальные, творческие, подвижные и кооперативные.Интеллектуальные больше предназначены для детей, которым надо развивать логику и эрудицию. В формате развлечений они смогут тренировать память и мышление. К таким играм относятся мемо, где надо запоминать картинки или слова.Стратегические и экономические развивают навыки предпринимателя и стратега. Они учат грамотному планированию.Творческие игры развивают воображение. Они требуют большей концентрации.
                Подвижные игры больше понравятся компаниям, потому что направлены на взаимодействие между игроками. 
                В кооперативной игре ребёнок будет развивать речь и коммуникативные навыки с помощью общения с другими игроками.</p>
            <p>Игры выбирают и по длительности процесса: от нескольких минут до нескольких часов.Время игры также зависит от количества участников и от того, насколько они хорошо знают правила. </p>
          </template>
        </vue-collapsible-panel> 
      </div>

      <div class="accordion__item">
        <vue-collapsible-panel :expanded="false">
          <template #title>
            <h4>Как изменить заказ после оформления?</h4>
          </template>
          <template #content>
            <p>Если в настольной игре собирается принять участие компания, нужно учитывать средний возраст игроков. Есть игры, которые не требуют активности и вряд ли понравятся молодёжи, а подвижные не придутся по душе пожилым людям.</p>
            <p>Многие игры предназначены только для большого количества участников, а другие — строго для двоих. Бывают и индивидуальные варианты, но чаще всего количество участников — от двух до четырёх.Количество игроков, на которое рассчитана игра, написано на её упаковке.
                Важно сразу решить, сколько человек примут участие в игре. Некоторые настольные игры могут быть скучны только для двоих. Если чаще будут играть именно двое, не стоит покупать игры, которые рассчитаны на большую компанию.</p>
            <p>Важно и то, как участники будут взаимодействовать между собой во время игры. Есть два основных варианта: каждый сам за себя или в команде.Реквизитом могут быть карты, игральные кости, бумага и карандаши, а также специальные приспособления, которые лежат в коробке.</p>
            <p>Выделяют несколько типов настольных игр: интеллектуальные, творческие, подвижные и кооперативные.Интеллектуальные больше предназначены для детей, которым надо развивать логику и эрудицию. В формате развлечений они смогут тренировать память и мышление. К таким играм относятся мемо, где надо запоминать картинки или слова.Стратегические и экономические развивают навыки предпринимателя и стратега. Они учат грамотному планированию.Творческие игры развивают воображение. Они требуют большей концентрации.
                Подвижные игры больше понравятся компаниям, потому что направлены на взаимодействие между игроками. 
                В кооперативной игре ребёнок будет развивать речь и коммуникативные навыки с помощью общения с другими игроками.</p>
            <p>Игры выбирают и по длительности процесса: от нескольких минут до нескольких часов.Время игры также зависит от количества участников и от того, насколько они хорошо знают правила. </p>
          </template>
        </vue-collapsible-panel> 
      </div>

      <div class="accordion__item">
        <vue-collapsible-panel :expanded="false">
          <template #title>
            <h4>Что делать, если заказ не пришел?</h4>
          </template>
          <template #content>
            <p>Если в настольной игре собирается принять участие компания, нужно учитывать средний возраст игроков. Есть игры, которые не требуют активности и вряд ли понравятся молодёжи, а подвижные не придутся по душе пожилым людям.</p>
            <p>Многие игры предназначены только для большого количества участников, а другие — строго для двоих. Бывают и индивидуальные варианты, но чаще всего количество участников — от двух до четырёх.Количество игроков, на которое рассчитана игра, написано на её упаковке.
                Важно сразу решить, сколько человек примут участие в игре. Некоторые настольные игры могут быть скучны только для двоих. Если чаще будут играть именно двое, не стоит покупать игры, которые рассчитаны на большую компанию.</p>
            <p>Важно и то, как участники будут взаимодействовать между собой во время игры. Есть два основных варианта: каждый сам за себя или в команде.Реквизитом могут быть карты, игральные кости, бумага и карандаши, а также специальные приспособления, которые лежат в коробке.</p>
            <p>Выделяют несколько типов настольных игр: интеллектуальные, творческие, подвижные и кооперативные.Интеллектуальные больше предназначены для детей, которым надо развивать логику и эрудицию. В формате развлечений они смогут тренировать память и мышление. К таким играм относятся мемо, где надо запоминать картинки или слова.Стратегические и экономические развивают навыки предпринимателя и стратега. Они учат грамотному планированию.Творческие игры развивают воображение. Они требуют большей концентрации.
                Подвижные игры больше понравятся компаниям, потому что направлены на взаимодействие между игроками. 
                В кооперативной игре ребёнок будет развивать речь и коммуникативные навыки с помощью общения с другими игроками.</p>
            <p>Игры выбирают и по длительности процесса: от нескольких минут до нескольких часов.Время игры также зависит от количества участников и от того, насколько они хорошо знают правила. </p>
          </template>
        </vue-collapsible-panel> 
      </div>

      <div class="accordion__item">
        <vue-collapsible-panel :expanded="false">
          <template #title>
            <h4>Как вернуть товар?</h4>
          </template>
          <template #content>
            <p>Если в настольной игре собирается принять участие компания, нужно учитывать средний возраст игроков. Есть игры, которые не требуют активности и вряд ли понравятся молодёжи, а подвижные не придутся по душе пожилым людям.</p>
            <p>Многие игры предназначены только для большого количества участников, а другие — строго для двоих. Бывают и индивидуальные варианты, но чаще всего количество участников — от двух до четырёх.Количество игроков, на которое рассчитана игра, написано на её упаковке.
                Важно сразу решить, сколько человек примут участие в игре. Некоторые настольные игры могут быть скучны только для двоих. Если чаще будут играть именно двое, не стоит покупать игры, которые рассчитаны на большую компанию.</p>
            <p>Важно и то, как участники будут взаимодействовать между собой во время игры. Есть два основных варианта: каждый сам за себя или в команде.Реквизитом могут быть карты, игральные кости, бумага и карандаши, а также специальные приспособления, которые лежат в коробке.</p>
            <p>Выделяют несколько типов настольных игр: интеллектуальные, творческие, подвижные и кооперативные.Интеллектуальные больше предназначены для детей, которым надо развивать логику и эрудицию. В формате развлечений они смогут тренировать память и мышление. К таким играм относятся мемо, где надо запоминать картинки или слова.Стратегические и экономические развивают навыки предпринимателя и стратега. Они учат грамотному планированию.Творческие игры развивают воображение. Они требуют большей концентрации.
                Подвижные игры больше понравятся компаниям, потому что направлены на взаимодействие между игроками. 
                В кооперативной игре ребёнок будет развивать речь и коммуникативные навыки с помощью общения с другими игроками.</p>
            <p>Игры выбирают и по длительности процесса: от нескольких минут до нескольких часов.Время игры также зависит от количества участников и от того, насколько они хорошо знают правила. </p>
          </template>
        </vue-collapsible-panel> 
      </div>
    </vue-collapsible-panel-group>
  </div>
</template>

<script>

export default {
  
}

</script>

<style lang="scss" >
  .accordion {
    max-width: 727px;

    &__item {
      border-bottom: 1px solid rgba(42, 42, 42, 0.12);
    }
  }

  h4 {
    font-weight: 500;
    font-size: 19px;
    line-height: 22px;
  }
  p {
    margin: 10px 0;
    font-weight: 400;
    font-size: 16px;
    line-height: 19px;
  }

  .vcp__body-content {
    padding-bottom: 15px;
  }

  .vcp__header {
    display: flex;
    justify-content: space-between;
    align-items: center;
    padding: 14px 0;
  }

  .vcp--expandable {
    .vcp__header-icon{
      transform: rotate(0deg);
      transition: transform .5s ease;
    }
  }
  .vcp--expanded {
    .vcp__header-icon{
      transform: rotate(-180deg);
      transition: transform .5s ease;
    }
  }


</style>